//
//  HeapSort.h
//  Sorting Algorithm
//
//  Created by DaFenQi on 16/10/11.
//  Copyright © 2016年 DaFenQi. All rights reserved.
//

#import "BaseSort.h"

/**
 *  堆排序
 */
/*
 (20 40 30 60 90 100 70 80 10 50)
 构造一个完全二叉树
           20
       40      30
    60   90  100  70
  80 10 50
 构造一个大顶堆
            100
         90      70
      80   40  30  20
    60 10 50
 // 一趟排序后得到
 50 90 70 80 40 30 20 60 10 100
 // 去掉100后继续构造大顶堆
            90
        80      70
     50   40  30  20
   60 10
 // 第二趟排序后得到
 10 80 70 50 40 30 20 60 90 100
 // 去掉90后继续构造大顶堆
           80
       50      70
    60   40  30  20
 10
 // 第三趟排序后得到
 10 50 70 60 40 30 20 80 90 100
 
 // 去掉80后继续构造大顶堆
          10
      50      70
    60   40  30  20
 // 第四趟排序后得到
 10 80 70 50 40 30 20 60 90 100
 
 // 去掉100后继续构造大顶堆
 90
 80      70
 50   40  30  20
 60 10
 // 第二趟排序后得到
 10 80 70 50 40 30 20 60 90 100
 
 // 去掉100后继续构造大顶堆
 90
 80      70
 50   40  30  20
 60 10
 // 第二趟排序后得到
 10 80 70 50 40 30 20 60 90 100
 
 // 去掉100后继续构造大顶堆
 90
 80      70
 50   40  30  20
 60 10
 // 第二趟排序后得到
 10 80 70 50 40 30 20 60 90 100
 
 */


@interface HeapSort : BaseSort

- (void)objectiveCSort:(NSMutableArray *)arr;
- (void)cSort:(NSMutableArray *)arr;

@end
